// components/Weather.js

const Social = () => {
  return (
    <div className="flex flex-wrap justify-between">
      <div className="w-full p-4 md:w-1/3">
        <div className="solution-box flex h-full flex-col rounded-lg bg-white p-6 shadow-lg">
          <h3 className="m-2 text-xl font-bold">দুর্যোগ প্রবন্ধন</h3>
          <ol className="flex-grow list-decimal pl-4 text-base text-gray-700">
            <li>
              আপনার এলাকায় কোন ধরনের দুর্যোগ সবচেয়ে বেশি ঘটতে পারে তা শনাক্ত
              করুন এবং প্রতিটির জন্য কীভাবে প্রস্তুতি নিতে হবে সে সম্পর্কে
              জানুন।
            </li>
            <li>
              আপনার সম্প্রদায়ের সতর্কতা ব্যবস্থা এবং সংকেত (সাইরেন, পাঠ্য
              বার্তা, ইত্যাদি) সম্পর্কে জানুন।
            </li>
            <li>
              একটি জাতীয় মহাসাগরীয় এবং বায়ুমণ্ডলীয় প্রশাসন আবহাওয়া রেডিও
              কেনার কথা বিবেচনা করুন৷ এই রেডিও দিনে 24 ঘন্টা, সপ্তাহের সাত দিন
              অফিসিয়াল সতর্কতা, ঘড়ি, পরামর্শ, পূর্বাভাস এবং অন্যান্য বিপদ
              সম্প্রচার করে।
            </li>
            <li>
              স্থানীয় সংস্থাগুলিকে চিহ্নিত করুন যারা জরুরী ব্যবস্থাপনা (রেড
              ক্রস/রেড ক্রিসেন্ট, অলাভজনক, ইত্যাদি) করে এবং তাদের সাথে কিভাবে
              যোগাযোগ করতে হয় তা জানুন।
            </li>
            <li>
              আপনার কর্মক্ষেত্রে, বাচ্চাদের স্কুলে বা অন্যান্য জায়গায় আপনি এবং
              আপনার পরিবার সময় কাটান এমন কোনো দুর্যোগ পরিকল্পনা সম্পর্কে নিজেকে
              শিক্ষিত করুন।
            </li>
          </ol>
        </div>
      </div>

      <div className="w-full p-4 md:w-1/3">
        <div className="solution-box flex h-full flex-col rounded-lg bg-white p-6 shadow-lg">
          <h3 className="m-2 text-xl font-bold">
            বাড়ি ও পরিবারের জন্য প্রস্তুতি
          </h3>
          <ol className="flex-grow list-decimal pl-4 text-base text-gray-700">
            <li>একটি দুর্যোগ সরবরাহ কিট একত্রিত করুন।</li>
            <li>
              প্রতিটি ধরণের দুর্যোগের জন্য আপনার বাড়িতে নিরাপদ স্থানগুলি সনাক্ত
              করুন৷
            </li>
            <li>আপনার বাড়ি থেকে সর্বোত্তম উচ্ছেদের রুটগুলি নির্ধারণ করুন৷</li>
            <li>প্রাথমিক চিকিৎসা এবং CPR বিষয়ে প্রশিক্ষিত হন।</li>
            <li>
              পরিবারের প্রতিটি সদস্যকে দেখান কিভাবে এবং কোথায় ইউটিলিটি (জল,
              গ্যাস, বিদ্যুৎ) বন্ধ করতে হবে।
            </li>
            <li>আপনার বাড়ি এবং সম্পত্তির একটি সম্পূর্ণ তালিকা তৈরি করুন।</li>
            <li>
              পরিবারের প্রতিটি সদস্যকে শিখান কিভাবে একটি অগ্নি নির্বাপক যন্ত্র
              ব্যবহার করতে হয় এবং একটি কোথায় খুঁজে পেতে হয়।
            </li>
            <li>
              ফ্রিজে জরুরি পরিচিতি (বন্ধু, পরিবার, প্রতিবেশী, পুলিশ, ফায়ার
              ইত্যাদি) পোস্ট করুন।
            </li>
          </ol>
        </div>
      </div>

      <div className="w-full p-4 md:w-1/3">
        <div className="solution-box flex h-full flex-col rounded-lg bg-white p-6 shadow-lg">
          <h3 className="m-2 text-xl font-bold">আশ্রয় কেন্দ্র</h3>
          <h3 className="font-semibold ">
            কিছু প্রশাসনিক আশ্রয় কেন্দ্রের তালিকা:
          </h3>
          <ul className="list-disc pl-4 text-base text-gray-700">
            <li>কোহিত সরকার প্রাথমিক বিদ্যালয়</li>
            <li>আব্দুল জলিল স্মৃতি উচ্চ বিদ্যালয়</li>
            <li>আব্দুল্লাহ আল মাহমুদ ডিগ্রী কলেজ</li>
            <li>আবদুল্লাহল-মাহমুদ মেমোরিয়াল স্কুল অ্যান্ড কলেজ</li>
            <li>এনায়েতপুর উপজেলা কমপ্লেক্স</li>
          </ul>
        </div>
      </div>
    </div>
  );
};

export default Social;
